let mah = prompt("لطفا ماه تولد خود را وارد کنید")

let fal = [
    'فال شماره 1',
    'فال شماره 2',
    'فال شماره 3',
    'فال شماره 4',
    'فال شماره 5',
    'فال شماره 6',
    'فال شماره 7',
    'فال شماره 8',
    'فال شماره 9',
    'فال شماره 10',
    'فال شماره 11',
]

if (mah == "1" ||
    mah == "فروردین" ||
    mah == "2" ||
    mah == "اردیبهشت" ||
    mah == "3" ||
    mah == "خرداد" ||
    mah == "4" ||
    mah == "تیر" ||
    mah == "5" ||
    mah == "مرداد" ||
    mah == "6" ||
    mah == "شهریور" ||
    mah == "7" ||
    mah == "مهر" ||
    mah == "8" ||
    mah == "آبان" ||
    mah == "9" ||
    mah == "آذر" ||
    mah == "10" ||
    mah == "دی" ||
    mah == "11" ||
    mah == "بهمن" ||
    mah == "12" ||
    mah == "اسفند") {

    let hafez = fal[Math.round(Math.random() * 10)]
    alert(hafez)

} else {
    alert("ماه وارد شده اشتباه است!")
}
